/* eslint-disable react/no-unescaped-entities */
import { DeepPartial, ITranslation } from "@declarations";

export const uk: DeepPartial<ITranslation> = {
  meta: {
    title: "Нерухомість у Туреччині",
    description: "Опис сайту"
  },
  alt: {
    logo: "Логотип Turnate"
  },
  ariaLabel: {
    telegram: "Перейти до Телеграму",
    whatsapp: "Перейти до Whatsapp",
    viber: "Перейти до Вайберу",
    openContacts: "Відкрити контакти",
    closeContacts: "Закрити контакти",
    openBurger: "Відкрити навігаційне меню",
    closeBurger: "Закрити навігаційне меню"
  },
  navigation: {
    seeEstate: "Дивитись нерухомість",
    why: "Чому Турречина?",
    steps: "Етапи оформлення",
    reviews: "Відгуки"
  },
  form: {
    labels: {
      name: "Ім'я",
      phone: "Телефон"
    }
  },
  common: {
    callback: "Замовити дзвінок",
    selectProperty: "Підібрати нерухомість",
    getSelection: "Отримати підбірку",
    submitting: "Відправка...",
    submit: "Залишити заяву",
    sent: "Ваше письмо було успішно відправлено!",
    connection: "Зв'язок через соц. мережі",
    credentials: "@2022 Усі права захищені",
    smthWrong: "Щось пішло не так!",
    aggrement:
      "Натискаючи на кнопку, я даю згоду на обробку персональних данних",
    consultation: (
      <>
        Безкоштовна <span>консультація</span> від експерта з нерухомості
      </>
    ),
    managerConsultation:
      "Наш менеджер проконсультує вас і відповість на всі питання",
    leaveYourContacts: "Залиште свої контакти"
  },
  pages: {
    home: {
      main: {
        title: (
          <>
            Підберемо<span> нерухомість у Туреччині</span> саме для вас
          </>
        ),
        text: "Ми пропонуємо послуги підбору та купівлі нерухомості інвесторам по всьому світу. Наш великий досвід дозволяє максимально точно розуміти очікування інвесторів та пропонувати унікальні рішення за приємною ціною.",
        advantages: [
          {
            title: "$350.000",
            caption: "Вартість апертаментів (від)"
          },
          {
            title: "24%",
            caption: "Перший внесок"
          },
          {
            title: "30%",
            caption: "Прибутковість (за рік)"
          },
          {
            title: "0%",
            caption: "Розстрочка"
          }
        ]
      },
      advantages: {
        title: (
          <>
            Чому варто обрати <span>саме нас?</span>
          </>
        ),
        slides: [
          {
            caption: "Ми декілька років на ринку та маємо",
            title: (
              <>
                <span>100 позитивних</span> відгуків{" "}
              </>
            ),
            paragraph: "від наших клієнтів"
          },
          {
            caption: "Працюємо безпосередньо лише з",
            title: (
              <>
                <span>перевіреними</span> підрядниками
              </>
            )
          },
          {
            caption: "Надаємо",
            title: (
              <>
                <span>найвигідніші</span> пропозиції
              </>
            ),
            paragraph: "ще на момент проектування новобудови"
          },
          {
            caption: "Гарантуємо",
            title: (
              <>
                <span>якість та повне</span> обслуговування нерухомості
              </>
            )
          },
          {
            caption: "Сучасний",
            title: (
              <>
                <span>підхід до</span> інвестицій
              </>
            )
          }
        ]
      },
      offer: {
        title: (
          <>
            Ми зібрали для вас <span>найкращі пропозиції</span>
          </>
        ),
        description: "У нашій колекції точно знайдеться те, що Вас зацікавить"
      },
      benefit: {
        title: (
          <>
            Чому це <span>вигідно?</span>
          </>
        ),
        description: [
          "Інвестиції в сектор будівництва та нерухомості в Туреччині стають центром тяжіння для корпоративних та індивідуальних інвесторів.",
          "У цьому процесі країна пропонує значні можливості іноземним вкладникам",
          "Щоб задовольнити потреби наших клієнтів та допомогти їм досягти великих успіхів в інвестиційних рішеннях, ми надаємо інвесторам індивідуальні пропозиції. Наша мінімальна сума вкладення – $70 000."
        ],
        statistic: [
          {
            title: "$90.000",
            caption: "Початкова ціна"
          },
          {
            title: "$99 000 (+10%)",
            caption: "Ціна через 3 місяці"
          },
          {
            title: "$108 900 (+20%)",
            caption: "Ціна через 6 місяців"
          }
        ],
        captionTitle: (
          <>
            Інвестуючи з нами, Ви отримуєте від{" "}
            <span>10% чистого прибутку</span> кожні <span>3 місяці.</span>
          </>
        ),
        captionDescription:
          "Також клієнт має можливість не лише заробити на нерухомості, а й отримати ВНП чи громадянство у Туреччині."
      },
      security: {
        title: <span>Безпека</span>,
        description:
          "Більшість тих, хто замислювався хоча б раз про купівлю нерухомості в Туреччині, ставить собі питання, а чи варте воно того? Давайте розглянемо деякі моменти і переконаємося, що робити це у нас – безпечно.",
        problemsTitle: (
          <>
            Можливі <span>проблеми</span> при покупці безпосередньо
          </>
        ),
        problems: [
          {
            title: (
              <>
                Недобросовісні <span>забудовники</span>
              </>
            ),
            description:
              "“На папері” Вам можуть запропонувати дуже вигідну новобудову за низькою ціною, а за підсумком - ні споруди, ні ваших грошей"
          },
          {
            title: (
              <>
                Покупка <span>"чужого" майна</span>
              </>
            ),
            description:
              "Одна з головних помилок - покупка нерухомості “за картинкою”. У такому разі, спроба “обійти систему” може дуже погано закінчитись"
          },
          {
            title: (
              <>
                <span>Шахрайство</span>
              </>
            ),
            description:
              "Особливо не розбираючись у сфері інвестицій, можна легко натрапити на шахраїв. Тому варто ретельно підходити до вибору посередника"
          }
        ],
        guaranteesTitle: (
          <>
            Наші <span style={{ display: "block" }}>гарантії</span>
          </>
        ),
        guarantees: [
          {
            title: (
              <>
                Наші партнери є <span>перевіреними забудовниками</span> на
                території Туреччини
              </>
            )
          },
          {
            title: (
              <>
                Ми маємо великий <span>досвід у роботі з інвестиціями</span>
                нерухомість
              </>
            )
          },
          {
            title: (
              <>
                <span>Гарантуємо безпеку</span> ваших коштів від початку
                співробітництва і до самого кінця
              </>
            )
          }
        ]
      },
      services: {
        title: (
          <>
            Що ви <span>отримуєте</span>, працюючи з нами
          </>
        ),
        cards: [
          {
            title: (
              <>
                Повне <span>обслуговування</span>
              </>
            ),
            description: [
              <>
                Інвестуючи з нами,
                <span>консультують наші менеджери</span>
                починаючи з етапу вибору нерухомості.
              </>,
              <>
                Ми готові відповісти на <span>всі запитання</span> та{" "}
                <span>допомогти розібратися</span> у всіх тонкощах.
              </>
            ]
          },
          {
            title: (
              <>
                У Туреччині — <span>як вдома</span>
              </>
            ),
            description: [
              <>
                Наша команда робить все можливе, аби наші інвестори{" "}
                <span>не мали труднощів.</span> Потрібна допомога з оформленням
                ВНП?
              </>,
              <>
                Бажаєте зробити ремонт? Не проблема!{" "}
                <span>Ми у цьому вам допоможемо.</span>
              </>
            ]
          },
          {
            title: (
              <>
                Постійний <span>прибуток</span>
              </>
            ),
            description: [
              <>
                Ми також займаємось <span>перепродажем нерухомості</span> своїх
                інвесторів.
              </>,
              <>
                Таким чином, ваші кошти завжди в роботі, і ви отримуєте
                <span>стабільний прибуток</span> з інвестицій.
              </>
            ]
          }
        ]
      }
    }
  }
};
